#+STARTUP: overview
#+latex_class_options: [14pt]

** DONE Example: $\mathbb{Z}_{6},+$

This is the [[id:770696d2-1294-4e86-ac3c-6803f9053537][Remainder Class]] group, also called the *additive group of integers modulo 6*.

#+BEGIN_SRC sage :session . :exports both
q=6
G6 = AdditiveAbelianGroup([q])

print(f"Elements of {G6}:")
[x for x in G6]
print(f"Order of {G6}: {G6.order()}")
print(f"{G6([2])} + {G6([5])} = {G6([2]) + G6([5])}")

# same as
Z6 = Zmod(q)
elems = [x for x in Z6]
print(f"Order of {Z6} {elems}: {Z6.order()}")
#+END_SRC

#+RESULTS:
: Elements of Additive abelian group isomorphic to Z/6:
: [(0), (1), (2), (3), (4), (5)]
: Order of Additive abelian group isomorphic to Z/6: 6
: (2) + (5) = (1)
: Order of Ring of integers modulo 6 [0, 1, 2, 3, 4, 5]: 6

** DONE Example: $(\mathbb{Z}_{5},*)$

#+BEGIN_SRC sage :session . :exports both
q=5
Z5 = Zmod(q)
G5 = Z5.unit_group() # multiplicative group mod 7
G5

print(f"Elements of {G5}:")
[x for x in G5]
print(f"Order of {G5}: {G5.order()}")
#+END_SRC

#+RESULTS:
: Multiplicative Abelian group isomorphic to C4
: Elements of Multiplicative Abelian group isomorphic to C4:
: [1, f, f^2, f^3]
: Order of Multiplicative Abelian group isomorphic to C4: 4

*** DONE Example: exponential map $Z_{4} \mapsto Z_{5}^{*}$

#+BEGIN_SRC sage :session . :exports both
q=5
G5 = Integers(q).unit_group()
n = G5.order()
g=2

print(f"G5={[x for x in G5]} is cyclic: {G5.is_cyclic()} of order {n} and with a generator g={g}")

Z4=Integers(n)

print(f"Exponential map that maps from Z_{n}=({[x for x in Z4]},+) to Z_5=({[x for x in G5]},*):")

def exp_map(q, g, x):
  return g^x % q

for x in Z4:
  print(f"exp({x}) = {g}^{x} = {exp_map(q,g,x)}")
#+END_SRC

#+RESULTS:
: G5=[1, f, f^2, f^3] is cyclic: True of order 4 and with a generator g=2
: Exponential map that maps from Z_4=([0, 1, 2, 3],+) to Z_5=([1, f, f^2, f^3],*):
: exp(0) = 2^0 = 1
: exp(1) = 2^1 = 2
: exp(2) = 2^2 = 4
: exp(3) = 2^3 = 3

*** DONE Example: Computations in the exponent
:PROPERTIES:
:ID:       15f34c88-8220-4fb3-82bb-cd890ecd85a4
:END:

For a prerequisite definitions see [[id:2a16eb2e-807a-4834-a83d-b1e15669f92f][Exponential map]]

Let's consider the multiplicative group ($\mathbb{Z}_5, \cdot$). It is cyclic of order 4, and has two generators : 2 and 3
Let's perform a computation 1 + 3 + 2 in (one of) the exponent of the generator of $\mathbb{Z}_5^{\cdot}$: $3$.

#+BEGIN_SRC sage :session . :exports both
q=5
F5 = GF(q)
Z5 = F5.unit_group() # (Z5,*)
n = Z5.order()
g = Z5[3] # f^2 is isomorphic to 3

Z4=Integers(n) # (Z4,+)

lhs = g^(Z4(1)+Z4(2)+Z4(3))
print(f"3^(1+2+3)={lhs}")

rhs = g^Z4(1) * g^Z4(2) * g^Z4(3)
print(f"3^(1) * 3^(2) * 3^(3)={rhs}")

lhs == rhs
#+END_SRC

#+RESULTS:
: 3^(1+2+3)=f^2
: 3^(1) * 3^(2) * 3^(3)=f^2
: True

*** IN-PROGRESS Example: Scalar multiplication for $(\mathbb{Z}_4, +)$
For a fixed generator $g \in \mathbb{Z}_4$ (e.g., $g = 1$), the exponential map is:

$\exp_g \colon \mathbb{Z} \to \mathbb{Z}_4, \quad \exp_g(k) = k \cdot g = \underbrace{g + g + \dots + g}_{k \text{ times}}$
where:
- *Input*: An integer $k \in \mathbb{Z}$.
- *Output*: An element $k \cdot g \in \mathbb{Z}_4$.

#+BEGIN_SRC sage :session . :exports both
q=4
Z4=AdditiveAbelianGroup([q])  # (Z4, +)
g=Z4.gen(0)
n=Z4.order()

def scalar_mult(q,g,x):
  return (x % q) * g;

for x in range(n):
  print(f"exp({x}) = {x}*{g} = {scalar_mult(q,g,x)}")
#+END_SRC

#+RESULTS:
: exp(0) = 0*(1) = (0)
: exp(1) = 1*(1) = (1)
: exp(2) = 2*(1) = (2)
: exp(3) = 3*(1) = (3)

*** DONE Example: base g discrete logarithm map

Let's consider the following logarithm map:

$log_3(\cdot): \mathbb{Z}_{5}^{*} \rightarrow \mathbb{Z}_{4}; \med x \mapsto log_3(x)$

Suppose we want to compute $log_3{4}$.
That means we need to find an $x$ s.t $3^x=4$, and all we can do is a brute-force method of inserting elements $x$ from \mathbb{Z}_{4} into the exponent of $g=3$ until the result is $4$:

#+BEGIN_SRC sage :session . :exports both
q = 5
Z5 = Zmod(q).unit_group()
g = Z5[3] # f^2 is isomorphic to 3
n=Z5.order()

y=Z5[2] # this is 4

Z4=Zmod(n)

for x in Z4:
  if g^x == y:
    print(f"log_3({y}) = {x}")
#+END_SRC

#+RESULTS:
: log_3(f^2) = 2

*** DONE Example: Exponential map for bn128

#+BEGIN_SRC sage :session . :exports both
F = GF(21888242871839275222246405745257275088696311157297823662689037894645226208583) # underlying field
E = EllipticCurve(F,[0,3]) # bn128
n=E.order()
G = E(1,2)#E.gen(0)

Zn=Integers(n)

# computing 5G = 3G + 2G
Zn(3) * G + Zn(2) * G == Zn(3+2)*G

# what is [n-1]G + G?
print(f"Zn(n-1)G + G = Zn(n)*G = {(n-1)*G + G} because Zn(n) = {Zn(n)}")

# computing [1/2]G + [1/2]G
# first we find the multiplicative inverse of 2 in Zn, for example using the Fermats Little Theorem:
two_inv=pow(2,n-2,n)
two_inv == Zn(2)^-1
print(f"1/2 = 2^(-1)={two_inv}")

half_G = two_inv * G
print(f"[1/2]G + [1/2]G = {G}: {half_G+half_G == G}")

# computing [1/3]G + [2/3]G
three_inv = Zn(3)^-1
print(f"[1/3]G + [2/3]G = {G}: {three_inv*G + 2*three_inv*G == G}")
#+END_SRC

#+RESULTS:
: True
: Zn(n-1)G + G = Zn(n)*G = (0 : 1 : 0) because Zn(n) = 0
: True
: 1/2 = 2^(-1)=10944121435919637611123202872628637544274182200208017171849102093287904247809
: [1/2]G + [1/2]G = (1 : 2 : 1): True
: [1/3]G + [2/3]G = (1 : 2 : 1): True

* IN-PROGRESS NOTES
- homomorphism

#+BEGIN_SRC sage :session . :exports both
q=7
Zn=Zmod(q).unit_group()
Zn.inject_variables()
Zn

[x.order() for x in Zn]
#+END_SRC

#+RESULTS:
: Defining f
: Multiplicative Abelian group isomorphic to C6
: [1, 6, 3, 2, 3, 6]
